## Terraform github repositories plan
```
data.github_team.test_team_access: Reading...
data.github_team.operations_engineering_test: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Refreshing state... [id=test-tamf-repo-test-org]
module.ministryofjustice.module.operations-engineering-dns-issues.github_repository.default: Refreshing state... [id=operations-engineering-dns-issues]
module.ministryofjustice.module.operations-engineering-dns-spike.github_repository.default: Refreshing state... [id=operations-engineering-dns-spike]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.ministryofjustice.module.tech-docs-monitor.github_repository.default: Refreshing state... [id=tech-docs-monitor]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.ministryofjustice.module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
data.github_team.test_team_access: Read complete after 0s [id=9472191]
module.ministryofjustice.module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.ministryofjustice.module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
data.github_team.operations_engineering_test: Read complete after 1s [id=9456244]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default: Refreshing state... [id=tech-docs-github-pages-publisher]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
module.ministryofjustice.module.terraform-template-poc.github_repository.default: Refreshing state... [id=terraform-template-poc]
module.ministryofjustice.module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.ministryofjustice.module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-github-actions-dashboard]
data.github_team.operations_engineering: Reading...
module.ministryofjustice.module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.ministryofjustice.module.github.github_repository.default: Refreshing state... [id=.github]
module.ministryofjustice.module.technical-guidance.github_repository.default: Refreshing state... [id=technical-guidance]
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Refreshing state... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.test_tamf_repo_2.github_repository.default: Refreshing state... [id=test-tamf-repo-2]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_repository.default: Refreshing state... [id=operations-engineering-kpi-dashboard-poc]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository.default: Refreshing state... [id=operations-engineering-octodns-poc]
module.ministryofjustice.module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.ministryofjustice.module.template-documentation-site.github_repository.default: Refreshing state... [id=template-documentation-site]
data.github_team.operations_engineering: Read complete after 5s [id=4192115]
module.ministryofjustice.module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default: Refreshing state... [id=operations-engineering-dns-form]
module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLPRAVc4CyGYH]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_repository_tag_protection.default: Refreshing state... [id=168994]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository_tag_protection.default: Refreshing state... [id=170153]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf2c4Cyrgo]
module.ministryofjustice.module.operations-engineering-dns-spike.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL4z9984C-v0W]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-spike.github_repository_tag_protection.default: Refreshing state... [id=190393]
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-monitor.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHQFa_s4CwPiA]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-monitor.github_repository_tag_protection.default: Refreshing state... [id=165188]
module.ministryofjustice.module.operations-engineering-dns-issues.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMIbLL84DDdaX]
module.ministryofjustice.module.operations-engineering-dns-issues.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-issues.github_repository_tag_protection.default: Refreshing state... [id=196802]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository_tag_protection.default: Refreshing state... [id=165174]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CwPGL]
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-metadata-poc:ECR_REGISTRY]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository_tag_protection.default: Refreshing state... [id=164899]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-issues.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-repository.github_repository_tag_protection.default: Refreshing state... [id=165191]
module.ministryofjustice.module.template-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDODYkhA84CwPiC]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEpRCis4CwPF-]
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-reports:ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_repository_tag_protection.default: Refreshing state... [id=165169]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository_tag_protection.default: Refreshing state... [id=165187]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_branch_protection.default: Refreshing state... [id=BPR_kwDOE7RAx84CwPh_]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering.github_branch_protection.default: Refreshing state... [id=BPR_kwDODVCV0c4CwPYY]
module.ministryofjustice.module.operations-engineering.github_repository_tag_protection.default: Refreshing state... [id=165184]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository_tag_protection.default: Refreshing state... [id=165168]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CwPF8]
module.ministryofjustice.module.terraform-github-repository.github_repository_tag_protection.default: Refreshing state... [id=166200]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-github-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4CwzoY]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.terraform-template-poc.github_repository_tag_protection.default: Refreshing state... [id=165190]
module.ministryofjustice.module.terraform-template-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOJKjnDs4CwPiD]
module.ministryofjustice.module.terraform-template-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.ministryofjustice.module.github-collaborators.github_repository_tag_protection.default: Refreshing state... [id=164898]
module.ministryofjustice.module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CwPGM]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository_tag_protection.default: Refreshing state... [id=165175]
module.ministryofjustice.module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-scim-github.github_repository_tag_protection.default: Refreshing state... [id=164897]
module.ministryofjustice.module.terraform-template-poc.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository_tag_protection.default: Refreshing state... [id=165171]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CwPF_]
module.ministryofjustice.module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository_tag_protection.default: Refreshing state... [id=164896]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.acronyms.github_repository_tag_protection.default: Refreshing state... [id=164902]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMRCOOM4DF_rj]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository_tag_protection.default: Refreshing state... [id=198172]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository_tag_protection.default: Refreshing state... [id=165176]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CwPGO]
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.github.github_repository_tag_protection.default: Refreshing state... [id=164900]
module.ministryofjustice.module.github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOFbeyoM4CwGtg]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository_tag_protection.default: Refreshing state... [id=164706]
module.ministryofjustice.module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.github-actions.github_repository_tag_protection.default: Refreshing state... [id=164901]
module.ministryofjustice.module.operations-engineering-support-metadata.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLWBtds4Cz8XQ]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository_tag_protection.default: Refreshing state... [id=172607]
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.technical-guidance.github_branch_protection.default: Refreshing state... [id=BPR_kwDOBeUD0s4CwPiB]
module.ministryofjustice.module.technical-guidance.github_repository_tag_protection.default: Refreshing state... [id=165189]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.test_tamf_repo_2.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf1s4Cyrgn]
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.test_tamf_repo_2.github_repository_tag_protection.default: Refreshing state... [id=170152]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL1tpxs4C9zwq]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_repository_tag_protection.default: Refreshing state... [id=188783]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-aws-mtasts.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHWUugs4CwPiH]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository_tag_protection.default: Refreshing state... [id=165192]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-octodns-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-octodns-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMK6SNs4DEK2K]
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository_tag_protection.default: Refreshing state... [id=197232]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4CwPGH]
module.ministryofjustice.module.operations-engineering-example.github_repository_tag_protection.default: Refreshing state... [id=165173]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-octodns-poc.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGION]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CwPGB]
module.ministryofjustice.module.operations-engineering-join-github.github_repository_tag_protection.default: Refreshing state... [id=165170]
module.ministryofjustice.module.operations-engineering-dns-form.github_repository_tag_protection.default: Refreshing state... [id=195963]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-form.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMDCRNs4DB666]
module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-documentation-site.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEQGgTs4CwPiI]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-documentation-site.github_repository_tag_protection.default: Refreshing state... [id=165193]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Refreshing state... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Refreshing state... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice.module.operations-engineering-octodns-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-octodns-poc]
module.ministryofjustice.module.operations-engineering-dns-issues.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-issues]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-actions]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.acronyms.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:acronyms]
module.ministryofjustice.module.operations-engineering-reports.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-reports]
module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.terraform-template-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-template-poc]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.template-documentation-site.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-documentation-site]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.template-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-repository]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:cloud-platform-maintenance-pages]
module.ministryofjustice.module.moj-terraform-aws-sso.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-aws-sso]
module.ministryofjustice.module.operations-engineering-dns-form.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-form]
module.ministryofjustice.module.operations-engineering-join-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-join-github]
module.ministryofjustice.module.moj-terraform-scim-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-scim-github]
module.ministryofjustice.module.operations-engineering-example.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-example]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-runbooks]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-metadata-poc]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-kpi-dashboard-poc]
module.ministryofjustice.module.operations-engineering-devcontainer.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-devcontainer]
module.ministryofjustice.module.github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:.github]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering]
module.ministryofjustice.module.technical-guidance.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:technical-guidance]
module.ministryofjustice.module.github-collaborators.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-collaborators]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-github-pages-publisher]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.tech-docs-monitor.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-monitor]
module.ministryofjustice.module.test_tamf_repo_2.github_team_repository.maintain["4192115"]: Refreshing state... [id=4192115:test-tamf-repo-2]
module.ministryofjustice.module.operations-engineering-dns-spike.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-spike]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-user-guide]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ministryofjustice.module.acronyms.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"a9adefccbf730022a8a54c48b1ca7f9f2c3fa8093ff0ef8290ad845794419609\"" -> "W/\"4e68970715dec52ff0bac9796b71eb31aaa58d689c552c0ec6b6e2602858ca55\""
        id                          = "acronyms"
        name                        = "acronyms"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"63f64333aa2cd6619da2ac65f7b46e1c89b94662041863b9ec6f5ae45fb9d0c4\"" -> "W/\"b01465411526c6ef83aac96545c5a0113e13cadcbf427c8a737a5396ff81ad83\""
        id                          = "cloud-platform-maintenance-pages"
        name                        = "cloud-platform-maintenance-pages"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.github.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"de2ca3935ff0f3c8b98aadb8a3d4b93442622c1448bf437d68501e7a6d15e66f\"" -> "W/\"725ba1ad49c50c0887c1d099ea4754dac79ecfc627f374cad4f70851df7835f2\""
        id                          = ".github"
        name                        = ".github"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.github-actions.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"39c5bb9e979d291b0058c7bc67e996cde809855caf6b4d2d03ac8e0895e90f5d\"" -> "W/\"866df6ebe7d2d5b3faef8862e400132868c29b9caa16e9b7ce1b0a2fd3cc8176\""
        id                          = "github-actions"
        name                        = "github-actions"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.github-collaborators.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"49730b9220086c2e33eba593dc2267ca38cc4a120a6390850e24e22dd0816bf2\"" -> "W/\"a41b9dc0ab6c00be9b018098582ffb536928abe4b724e9243e399705fbd5ef69\""
        id                          = "github-collaborators"
        name                        = "github-collaborators"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.moj-terraform-aws-sso.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"65e8f75e0486250d2a17e5a60eac4768b4b1cbf9012ab2c17909ddd1a9291b3d\"" -> "W/\"cbd5954c201c2cd02141c06d1078f92e77cd8179bd9ad01c09b1cbcd421b43f4\""
        id                          = "moj-terraform-aws-sso"
        name                        = "moj-terraform-aws-sso"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"1f2deed47e6ec3b3766fba041ed7767a305caf6e430a9964dfdb339bedec3c2e\"" -> "W/\"0650466fd32e69257ebd81225cbf709759313e5a1031a0791506bea2a705d3e9\""
        id                          = "moj-terraform-scim-github"
        name                        = "moj-terraform-scim-github"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"a4ff527a2601594cc371489f8c95291ce71941562ab49482815087d01faf1e17\"" -> "W/\"aa9e8261df23175857dd5292720149078e0cfbf12ee7129af7ba495b8d7931a9\""
        id                          = "operations-engineering"
        name                        = "operations-engineering"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"ec65b6a6c62f383425d37a869bcefc139f53be1c04ad9433bd522cd00054704f\"" -> "W/\"f2cda151d0cbdbdff16ba62701cd6421fab8665e8f0bb1665728ec08e9825173\""
        id                          = "operations-engineering-certificate-renewal"
        name                        = "operations-engineering-certificate-renewal"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"972a581b7db3ab117997a3b51bd1245f37bda2cd357242439639826558d05c08\"" -> "W/\"3910acb24ba661a1e7c3dfb1a97cb79657c3019754d7104042ca6c24c9e3ff38\""
        id                          = "operations-engineering-devcontainer"
        name                        = "operations-engineering-devcontainer"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"4de4b2947daf3a660bf6d7bd9389836d9b07b753eabf11608a01c048ff4db9c6\"" -> "W/\"11269b992cc6e6934e9083e76ae3782731ebe27b40b5ebb6cd944b3559f04cc5\""
        id                          = "operations-engineering-dns-form"
        name                        = "operations-engineering-dns-form"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-issues.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"6ab615b408c8c4bdbc89eee2197c7cddce85def63e57ff5ab44645dda3ec73dc\"" -> "W/\"08141ec02ab0e26964b6517d16643189b7cc7b1dc27da121773cbc3bc6f72b4e\""
        id                          = "operations-engineering-dns-issues"
        name                        = "operations-engineering-dns-issues"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-spike.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"1dd6136c6cdcc6119fe6566e55886616f8595ab14905f2d51533845798cbbcb6\"" -> "W/\"d60ad315ea96f548ca4c02dc22a9613f4b83e2afc3c02be7fa4a1c4b4ddfb657\""
        id                          = "operations-engineering-dns-spike"
        name                        = "operations-engineering-dns-spike"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"fefccbb0e4e5e57144ced2eb9a3748fe626a360cfa46df0436eb2ecc2bd46d4f\"" -> "W/\"7c712af019223797c7ed6ee3a868877638366c181be8bbbc0235ec13057102d0\""
        id                          = "operations-engineering-documentation-browser-extension"
        name                        = "operations-engineering-documentation-browser-extension"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-example.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"5850d6104690607403ba7d0c4a4d7d14c45ae553cd5e018df761218b6a11e1f3\"" -> "W/\"6ecb1323ea4447bda880c12dc6eced498e3b0c835fbb99ae35b6df1b90341260\""
        id                          = "operations-engineering-example"
        name                        = "operations-engineering-example"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_branch_protection.default has changed
  ~ resource "github_branch_protection" "default" {
      + force_push_bypassers            = []
        id                              = "BPR_kwDOMRCOOM4DF_rj"
      + push_restrictions               = []
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          + dismissal_restrictions          = []
          + pull_request_bypassers          = []
            # (5 unchanged attributes hidden)
        }

      ~ required_status_checks {
          + contexts = []
            # (1 unchanged attribute hidden)
        }
    }

  # module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"2301b8fba851eab52d0a1f1acb5070ff068e6360db6bde65de525d250e6b6f08\"" -> "W/\"36bb8ae7c5416ad7cfa80b91c3c64be5299f5c1f60ba619ed441ed0145fb0722\""
        id                          = "operations-engineering-github-actions-dashboard"
        name                        = "operations-engineering-github-actions-dashboard"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-join-github.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"e8a4908b2482eebe515ceb3cf15ca4a314ee927535ee74b4004fe307859944b5\"" -> "W/\"75d4fb634c2f496de13c63a22a982908381fe1e1f92e9b6d772080a60be63db0\""
        id                          = "operations-engineering-join-github"
        name                        = "operations-engineering-join-github"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"7fa520eebc2c88e98521c8a208d9284200fddf4e54bd4e67a3c3b7a8c2d22952\"" -> "W/\"103338403029ce359fcd089ab4bda29e1e2136e9235ecd8645282f94c3c88dbf\""
        id                          = "operations-engineering-kpi-dashboard-poc"
        name                        = "operations-engineering-kpi-dashboard-poc"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"1fe4ac45de6a294415438022b32e07f7929c724ae2cf221b685e353e8f9a37c9\"" -> "W/\"138336423180f29918a6e80c8115b7b80e1063a4e20e3249e169be84358e847c\""
        id                          = "operations-engineering-metadata-poc"
        name                        = "operations-engineering-metadata-poc"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"b87522687e9a61b6be5c7762666c65aa276ca62c031bc15f3a1f0fa4de0fbfe2\"" -> "W/\"5b40cae70fe604063597913d9b11f70e49cbfd075ff23f3e082a04b82840e8d2\""
        id                          = "operations-engineering-octodns-poc"
        name                        = "operations-engineering-octodns-poc"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-reports.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"c08559f664275d4e7de3baf41ca4077352d367f471f99420a3e675dafdbbd7a9\"" -> "W/\"969b951afe30be63a1e551c52cc6aa777aea648ce51bd74fa1ceabe049ecebf3\""
        id                          = "operations-engineering-reports"
        name                        = "operations-engineering-reports"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"eddf8f5ec3ed32b794851a72bf17bf40dd1e58b57f51f8e14d60f94304a84321\"" -> "W/\"d6b26c972d056ed1e6bee5b7828993a6c399b4eb8593a0d139fe0260c6d2eb91\""
        id                          = "operations-engineering-runbooks"
        name                        = "operations-engineering-runbooks"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"c307310805e6e1eee4fe324fec3f5a5cd48553ba611cb9b2322313954ed4c7d1\"" -> "W/\"77ff8f8705884bd09c8fe8913ea4a75a2072cfdfe22494e4056fed2f7d7061f0\""
        id                          = "operations-engineering-support-metadata"
        name                        = "operations-engineering-support-metadata"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"2032a2ee887b0bd85a2d8637268c15a82709fcf45bbdbbb39131e2cb21891fec\"" -> "W/\"4a49c66a542973145884cba8e5de8dbab6c6b9552784330768ae93197afd57b0\""
        id                          = "operations-engineering-user-guide"
        name                        = "operations-engineering-user-guide"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"f43848d1c9f11a96769cd8c84cb6f6764bc1dfe968827217420f834d72f604fc\"" -> "W/\"1e48a85e0d9cf899b718f2cb8edb259202c8fed3f8290e3230f16317545170d5\""
        id                          = "tech-docs-github-pages-publisher"
        name                        = "tech-docs-github-pages-publisher"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.tech-docs-monitor.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"c022075adda0c0e74faeded27653aef04055b92512b28fc96cdae3c372224c38\"" -> "W/\"5972a6718f61618179df6fa135f5759ac35ebfd9222ee8e9a5e1c6dd1868c60a\""
        id                          = "tech-docs-monitor"
        name                        = "tech-docs-monitor"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.technical-guidance.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"f0ecbda6bfcbe58b7c447124a633fe248f791ce6e5f2db393e6af7bf5742d7a4\"" -> "W/\"32107680922288e7dee41434c460b36509aa0ea80640a9b95045b0860f7b9d77\""
        id                          = "technical-guidance"
        name                        = "technical-guidance"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.template-documentation-site.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"9d08767a083ac2be8c0d15142876d8ec729371fae2b1a501f3c898bdffc732eb\"" -> "W/\"755121f613ffec47ed15c1f017d9fdda1b2d018074ebfb14649b8bc77231d287\""
        id                          = "template-documentation-site"
        name                        = "template-documentation-site"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.template-repository.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"4c814af3c6324909ee3321c755ca2639ae427bfc7383da01fb3de2517c5018c3\"" -> "W/\"97c71f7a3ab1984c5b1d915670cfc29c51b34097cb2fddbdda03ddfb9f84f22d\""
        id                          = "template-repository"
        name                        = "template-repository"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"206e614af1a5ea60711e356166dcd8013d01884b76333e83716fcd467f130bbb\"" -> "W/\"ae31b59f1501167350f3eb9c69a125b3f36cf9b1315b2a4992d687730243df48\""
        id                          = "terraform-aws-mtasts"
        name                        = "terraform-aws-mtasts"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.terraform-github-repository.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"653b9eaa087da7febd4ca58ba6890097bf1279081d7021d72da5a88f3f7207c6\"" -> "W/\"b8b63420e7ecd8aa17aafbdb31f63a12120dada208f9a8dfcd9a10c2b2b132a9\""
        id                          = "terraform-github-repository"
        name                        = "terraform-github-repository"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.terraform-template-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"460f0845c359ecd971bb0265393098d5f8deb0dcff40ad486a3ae46548f2b086\"" -> "W/\"aafa7bfe24c8742a06dd7a19d3cc59ccf2fc625b95309e3e089399d54acfe3d0\""
        id                          = "terraform-template-poc"
        name                        = "terraform-template-poc"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.test_tamf_repo_2.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"9b527ee1676ae1451b6fc70faf109f117b2e6720ba08aeaf0136e844af66e85f\"" -> "W/\"9628d519c874b8fc4a552f99efbdcb5c68d5e78435a2f0035b8b4fd066ad45bc\""
        id                          = "test-tamf-repo-2"
        name                        = "test-tamf-repo-2"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice-test.module.test-repo-levg.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"67bd2ef9495c3afb7595fb34fdd9bd285575a3c78cf1e45a6abf8c647235f6c8\"" -> "W/\"65bdf87544e96bd978ef7f235ca84b0b04170ebc997b38b68f8098a7823a0240\""
        id                          = "test-repo-levg"
        name                        = "test-repo-levg"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"9998fcf6416d4e1b2406350127b18eba1577db6c801eee0f02f8ccaaffbf7b9a\"" -> "W/\"811f449d034d3a3872d757a621e12af250fa1b50897601294cb12ce6350d7b24\""
        id                          = "test-tamf-repo-test-org"
        name                        = "test-tamf-repo-test-org"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ministryofjustice.module.operations-engineering-secrets-manager.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-secrets-manager.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.ministryofjustice.module.operations-engineering-secrets-manager.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A GitHub repository to synchronise secrets between AWS Secrets Manager and Operations Engineering repositories. • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "operations-engineering-secrets-manager"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "operations-engineering",
          + "terraform",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-secrets-manager.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = (known after apply)
      + tag_protection_id = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-secrets-manager.github_team_repository.admin["4192115"] will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "operations-engineering-secrets-manager"
      + team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-test-secrets-manager.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-test-secrets-manager.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.ministryofjustice.module.operations-engineering-test-secrets-manager.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A test repository for the secret manager PoC. • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "operations-engineering-test-secrets-manager"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "operations-engineering",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-test-secrets-manager.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = (known after apply)
      + tag_protection_id = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-test-secrets-manager.github_team_repository.admin["4192115"] will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "operations-engineering-test-secrets-manager"
      + team_id    = "4192115"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```